// ## Task 1  Реалізувати онлайн калькулятор, який буде розраховувати площу трикутника за трьома сторонами за допомогою формули Герона

function areaHeron(a, b, c) {
    let p = (a + b + c) / 2;
    let area = Math.sqrt(p * (p - a) * (p - b) * (p - c));
    return area;
}
console.log(areaHeron(3, 4, 5)); 



// ## Task 2  Реалізувати онлайн калькулятор, який буде розраховувати площу трикутника за двома сторонами і кутом між ними

function areaAngle(a, b, degrees) {
    let radians = degrees * (Math.PI / 180);
    let area = (a * b * Math.sin(radians)) / 2;
    return area;
}


// ## Task 3  Реалізувати онлайн калькулятор, який буде розраховувати площу трикутника за стороною трикутника і висотою
// ## Task 4  Реалізувати онлайн калькулятор, який буде розраховувати площу трикутника за стороною трикутника і висотою

function areaBaseAltitude(a, h) {
    return (a * h) / 2;
}



// ## Task 5  Реалізувати онлайн калькулятор, який буде розраховувати площу трикутника за трьома сторонами і радіусом описаного кола

function areaThreeCircumradius(a, b, c, R) {
    if (R <= 0) return 0;
    return (a * b * c) / (4 * R);
}



